# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\dell\Documents\PSoC Creator\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Mon, 31 Aug 2020 10:59:00 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]


# Component constraints for C:\Users\dell\Documents\PSoC Creator\Workspace03\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\dell\Documents\PSoC Creator\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Mon, 31 Aug 2020 10:58:59 GMT
